/// $Header
/// ============================================================================
///		Author		: M. Ivanchenko
///		Date create	: 18-03-2016
///		Date update	: 21-03-2016
///		Comment		:
/// ============================================================================

#include "ware_name_text.h"
#include "ware_name_converter.h"
#include <QRegExp>

namespace rele_auto
{

/// ############################################################################
///			class ware_name_text
/// ############################################################################

    /// ========================================================================
    ///		CONSTRUCTORS/DESTRUCTOR
    /// ========================================================================

    /// ------------------------------------------------------------------------
	///	ware_name_text( )
    /// ------------------------------------------------------------------------
	ware_name_text::ware_name_text( const QString &text ) :
		QString( text )
	{
		this->prepare( );
	}

    /// ------------------------------------------------------------------------
	///	~ware_name_text( )
    /// ------------------------------------------------------------------------
	ware_name_text::~ware_name_text( )
	{
	}

    /// ========================================================================
    ///		PROPERTIES
    /// ========================================================================

    /// ========================================================================
    ///		OPERATORS
    /// ========================================================================

    /// ========================================================================
    ///		FUNCTIONS
    /// ========================================================================
    /// ------------------------------------------------------------------------
	///	prepare( )
    /// ------------------------------------------------------------------------
	void ware_name_text::prepare( )
	{
		//варианты с русской 'З'
		this->prepare_3( );
		//переводим строку в верхний регистр
		QString tmp_s = this->toUpper( );
		this->swap( tmp_s );
		//замена схожей кириллицы на латиницу
		tmp_s = the_ware_symbol_replacer( ).replace( *this );
		this->swap( tmp_s );
		//замена специальных комбинаций
		tmp_s = the_ware_symbol_replacer( ).replace_spec( *this );
		this->swap( tmp_s );
	}

    /// ------------------------------------------------------------------------
	///	prepare_3( )
    /// ------------------------------------------------------------------------
	void ware_name_text::prepare_3( )
	{
		//русская буква 'З'
		QRegExp rx3( "З", Qt::CaseSensitive, QRegExp::RegExp2 );
		int pos = rx3.indexIn( *this );
		if( pos == -1 )
		{
			return;
		}
		//сочетание русских 'ЗЗ' перед 'Н' или 'П' (ЗЗН,ЗЗП)
		if( this->prepare_33H( ) )
		{
		}
		//сочетание русских 'Зв'итд
		else if( this->prepare_3v( ) )
		{
		}
		//сочетание 'ДЗТ'итд
		else if( this->prepare_D3T( ) )
		{
		}
		//сочетание '1"З"'итд
		else if( this->prepare_1_3( ) )
		{
		}
		//сочетание 'Э[AА]З'
		else if( this->prepare_A3( ) )
		{
		}
		//в остальных случаях замена русской 'З' на тройку
		this->replace( rx3, "3" );
	}

    /// ------------------------------------------------------------------------
	///	prepare_33H( )
    /// ------------------------------------------------------------------------
	bool ware_name_text::prepare_33H( )
	{
		//сочетание русских 'ЗЗ' перед 'Н' или 'П' (ЗЗН,ЗЗП)
		QRegExp rx33H( "ЗЗ(?=[HНП])", Qt::CaseSensitive, QRegExp::RegExp2 );
		int pos = rx33H.indexIn( *this );
		if( pos == -1 )
		{
			return false;
		}
		//если найдено, меняем на маленькие 'зз'
		this->replace( rx33H, "зз" );

		return true;
	}

    /// ------------------------------------------------------------------------
	///	prepare_3v( )
    /// ------------------------------------------------------------------------
	bool ware_name_text::prepare_3v( )
	{
		//сочетание русских 'Зв'итд
		QRegExp rx3v( "З(?=[авНH])", Qt::CaseSensitive, QRegExp::RegExp2 );
		int pos = rx3v.indexIn( *this );
		if( pos == -1 )
		{
			return false;
		}
		//если найдено, меняем на маленькие 'з'
		this->replace( rx3v, "з" );

		return true;
	}

    /// ------------------------------------------------------------------------
	///	prepare_D3T( )
    /// ------------------------------------------------------------------------
	bool ware_name_text::prepare_D3T( )
	{
		//сочетание 'ДЗТ'
		QRegExp rxD3T( "ДЗ[ТT]", Qt::CaseSensitive, QRegExp::RegExp2 );
		int pos = rxD3T.indexIn( *this );
		if( pos == -1 )
		{
			return false;
		}
		//если найдено, меняем на маленькие 'з'
		this->replace( rxD3T, "ДзТ" );

		return true;
	}

    /// ------------------------------------------------------------------------
	///	prepare_1_3( )
    /// ------------------------------------------------------------------------
	bool ware_name_text::prepare_1_3( )
	{
		//сочетание '1"З"'итд
		QRegExp rx1_3( "(?<=[1-9])[\"'«]?З", Qt::CaseSensitive, QRegExp::RegExp2 );
		int pos = rx1_3.indexIn( *this );
		if( pos == -1 )
		{
			return false;
		}
		//если найдено, меняем на маленькие 'з'
		this->replace( rx1_3, "з" );

		return true;
	}

    /// ------------------------------------------------------------------------
	///	prepare_A3( )
    /// ------------------------------------------------------------------------
	bool ware_name_text::prepare_A3( )
	{
		//сочетание 'Э[AА]З'
		QRegExp rxA3( "Э[AА]З", Qt::CaseSensitive, QRegExp::RegExp2 );
		int pos = rxA3.indexIn( *this );
		if( pos == -1 )
		{
			return false;
		}
		//если найдено, меняем на маленькие 'ЭАз'
		this->replace( rxA3, "ЭАз" );

		return true;
	}


/// ############################################################################
}//namespace rele_auto
